# Referenties

Altijd beginnen met 'getting started':

https://pandas.pydata.org/docs/getting_started/index.html#getting-started

Dan een snel overzicht:

https://pandas.pydata.org/docs/user_guide/10min.html

Daarna kijken naar de API beschrijving:

https://pandas.pydata.org/docs/reference/index.html

# Installatie

Run `pip3 install pandas` in the terminal to install the Pandas library.

# Imports

In [77]:
import pandas as pd

import matplotlib.pyplot as plt

# Schetsen

In [99]:
# Dataframe maken
df = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [
            22,
            35,
            58
        ],
        "Sex": [
            "male",
            "male",
            "female"
        ],
    }
)


#index = ["a", "b", "c"]

# Standaard print
print(df)

# Vergelijk met
df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [100]:
# Data opslaan
df.to_csv('./output/persona.csv',header=True, index=False)

In [101]:
df_saved = pd.read_csv('./output/persona.csv')

display(df_saved)

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [102]:
# De kolomnaam
df.columns

Index(['Name', 'Age', 'Sex'], dtype='object')

In [154]:
# Kan geen nummers lezen. Alleen namen van de colums.

# display(df['Age'])
df['Age']

0    22
1    35
2    58
Name: Age, dtype: int64

In [104]:
# Een kolom lezen

display(df.Name)

#je kan de keynaam simplificeren: 

# age = 'Age'
# df(age)

0     Braund, Mr. Owen Harris
1    Allen, Mr. William Henry
2    Bonnell, Miss. Elizabeth
Name: Name, dtype: object

In [105]:
# Een kolom verwijderen
#col=df.pop('Age')

#Dit verwijdert de column uit de data. Om de originele waarde te behouden:
df_copy = df.copy()

In [106]:
# .drop default is 'axis=0'. De 0-axis is een index, geen column
# df_copy_copy = df_copy.drop('Age', axis=1)

In [107]:
display(col)

0    22
1    35
2    58
Name: Age, dtype: int64

In [108]:
# Een rij lezen

#bij indexen kan je wel ints. invullen. (Tenzij je ze hebt veranderd naar [a, b, c] oid)
# loc = location

df.loc[0]

Name    Braund, Mr. Owen Harris
Age                          22
Sex                        male
Name: 0, dtype: object

In [109]:
df.iloc[0,1]

22

In [157]:
# Functie getRow() maken
def getRow(dataframe, index): 
        return df.iloc[index]
    
getRow(df, )

Name    Allen, Mr. William Henry
Age                           35
Sex                         male
Name: 1, dtype: object

In [168]:
# Een rij toevoegen
df_copy = df.copy()

df_copy.loc[3] = ["Ruud", 44, "Male"]

display(df_copy)

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female
3                      Ruud   44    Male

In [136]:
# df_copy = df.copy()

# df_copy.loc[4] = ["Hans", 54, "male"]
# display(df_copy)

In [133]:
# Functie insertAt(row, index)
# ...

In [134]:
# Verkennen
# ...

In [142]:
# Filteren
df.query("Age > 30 and Sex == 'male'")

                       Name  Age   Sex
1  Allen, Mr. William Henry   35  male

In [153]:
#zoek op mevrouw Bonnell

df(df["Name"].str.contains["Bonnell"])

TypeError: 'method' object is not subscriptable

In [136]:
# Groeperen
# ...

In [137]:
# Extra: toepassing OOP en het bouwen van je eigen library
# ...